In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd

In [5]:
se = pd.Series([4,8,15,16,23,42])

In [6]:
se

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
l1 = [1,1,2,3,5,8,13,21,43]

In [8]:
pd.Series(l1)

0     1
1     1
2     2
3     3
4     5
5     8
6    13
7    21
8    43
dtype: int64

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:

In [9]:
df = pd.DataFrame({"Name" : ["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]})

In [10]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
DataFrame:- A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion 
            in rows and columns.
    
            Features of DataFrame
            1.Potentially columns are of different types
            2.Size – Mutable
            3.Labeled axes (rows and columns)
            4.Can Perform Arithmetic operations on rows and columns
              Structure
                
            Pandas Series :-
            1. One Dimensional 
            2.Series elements must be of thr same data type
            3.Size - immutable

In [11]:
# Series 
l1 = [1,2,3,4,5,6,7]

In [12]:
se = pd.Series(l1)

In [13]:
se

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [14]:
# Dataframe
df = pd.DataFrame({"name":["anu","hari","Bob"],"age":[23,21,43]})

In [15]:
df

   name  age
0   anu   23
1  hari   21
2   Bob   43

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
    you give an example of when you might use one of these functions?

In [ ]:
Ans :-  Some common functionc we can use to manipulate data in a Pandas DataFrame ...
        1.read data
            - read_csv()
        2.Head and Tail
            -  .head()
            -  .tail()
            
            To see the data frame we can use df.head(). Head returns the first rows, if no input is given it will always show above 5 rows. 
            In contrast to see below rows, we can use df.tail()
            
            
        
        3. Shape, Size and Info
            - .shape
            - .size()
            - .info()
            
            df.shape, it gives a total number of rows and then columns. df.size() returns the number of rows times number of columns in the data frame.
            We can also use df.info(), from that we get different information such as rows fromRangeIndex, Data columns and then data type of each column.
            It also includes the information of non-null counts.
            
        4. Describe
            -  .describe()
                Then to understand basic statistics of variables we can use df.describe().
                It will give you count, mean, standard deviation, and also 5 number summary.

In [17]:
df1 = pd.DataFrame({"Number":[1,2,3,4,5,6],"Squroot":[1,4,9,16,25,36]})

In [18]:
df1

   Number  Squroot
0       1        1
1       2        4
2       3        9
3       4       16
4       5       25
5       6       36

In [19]:
df1.head()

   Number  Squroot
0       1        1
1       2        4
2       3        9
3       4       16
4       5       25

In [20]:
df1.tail()

   Number  Squroot
1       2        4
2       3        9
3       4       16
4       5       25
5       6       36

In [21]:
df1.describe()

         Number    Squroot
count  6.000000   6.000000
mean   3.500000  15.166667
std    1.870829  13.377842
min    1.000000   1.000000
25%    2.250000   5.250000
50%    3.500000  12.500000
75%    4.750000  22.750000
max    6.000000  36.000000

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
Ans:- DataFrame and Panel are mutable and Series is immutable

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [22]:
s1 = pd.Series(["hari","Aman","Pal","Kamal"],name="Name")

In [23]:
s2 = pd.Series([22,20,10,23],name = "Age")

In [24]:
df3 = pd.concat([s1,s2], axis=1)

In [25]:
df3

    Name  Age
0   hari   22
1   Aman   20
2    Pal   10
3  Kamal   23